//===================================================
//
// キャラクターの更新処理 [character_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _CHARACTER_SYSTEM_H_
#define _CHARACTER_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// キャラクターの更新処理の定義
//***************************************************
struct CharacterSystem : SystemBase
{
	CharacterSystem() = default;
	~CharacterSystem() = default;

	void Update(entt::registry& registry) override;
private:
};
#endif