//===================================================
//
// キャラクター共通の定数データ [character_constants.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _CHARACTER_CONSTANTS_HPP_
#define _CHARACTER_CONSTANTS_HPP_

//***************************************************
// キャラクター共通の定数データの名前空間の定義
//***************************************************
namespace CharacterConstants
{
	constexpr float SHOT_ANGLE_RANGE = D3DXToRadian(30);	// 打つ方向の最大、最小
}
#endif