//===================================================
//
// コライダーの処理 [collider_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _COLLIDER_SYSTEM_H_
#define _COLLIDER_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// コライダーの処理の定義
//***************************************************
struct ColliderSystem : SystemBase
{
	ColliderSystem() = default;
	~ColliderSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif