//===================================================
//
// デバッグ情報を表示するクラス [debug_info.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _DEBUG_INFO_H_
#define _DEBUG_INFO_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "entt.hpp"

//***************************************************
// デバッグ情報の表示クラスの定義
//***************************************************
class CDebugInfo
{
public:
	~CDebugInfo();

	static void Debug(entt::registry& registry, const int nFps);
private:
	CDebugInfo();
};
#endif