//===================================================
//
// デバッグ情報の更新処理 [debug_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _DEBUG_SYSTEM_H_
#define _DEBUG_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// デバッグの更新処理の定義
//***************************************************
struct DebugSystem : public SystemBase
{
	DebugSystem() = default;
	~DebugSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif