//===================================================
//
// エフェクトの更新処理 [effect_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _EFFECT_SYSTEM_H_
#define _EFFECT_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// 敵の更新処理の定義
//***************************************************
struct EffectSystem : SystemBase
{
	EffectSystem() = default;
	~EffectSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif