//===================================================
//
// エンティティのレイヤーの定義 [entity_layer.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _ENTITY_LAYER_H_
#define _ENTITY_LAYER_H_

//***************************************************
// 描画のレイヤーの定義
//***************************************************
enum class EntityLayer : int
{
	Camera = 0, // カメラ
	Model,		// モデル
	Character,	// キャラクター
	Mesh,		// メッシュ
	Shadow,		/// 影
	Sprite,		// 2D
	Max
};
#endif