//===================================================
//
// 煙、爆発のマネージャーの定義 [explotion_manager.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _EXPLOTION_MANAGER_H_
#define _EXPLOTION_MANAGER_H_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// 煙、爆発のマネージャーの定義
//***************************************************
namespace ExplotionManager
{
	void BallLandingExplotion(entt::registry& registry, const D3DXVECTOR3& pos, const int nNum, const D3DXVECTOR3& move);
}
#endif