//===================================================
//
// ジェットパックの更新処理の定義 [jet_pack_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _JETPACK_SYSTEM_H_
#define _JETPACK_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// ジェットパックの更新処理の定義
//***************************************************
struct JetPackSystem : SystemBase
{
	JetPackSystem() = default;
	~JetPackSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif