//===================================================
//
// ロケーターの更新処理(デバッグ用) [locator_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _LOCATOR_SYSTEM_H_
#define _LOCATOR_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// ロケーターの更新処理(デバッグ用)
//***************************************************
struct LocatorSystem : SystemBase
{
	LocatorSystem() = default;
	~LocatorSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif