//===================================================
//
// メニュー選択の更新処理 [menu_select_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MENU_SELECT_SYSTEM_H_
#define _MENU_SELECT_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// メニュー選択の更新処理
//***************************************************
struct MenuSelectSystem : SystemBase
{
	MenuSelectSystem() = default;
	~MenuSelectSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif