//===================================================
//
// マルチテクスチャのメッシュ描画処理 [mesh_renderer_mt.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_RENDERER_MT_H_
#define _MESH_RENDERER_MT_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "renderer_system_base.h"

//***************************************************
// マルチテクスチャのメッシュの描画処理
//***************************************************
struct MeshRendererMT : RendererSystemBase
{
	MeshRendererMT() = default;
	~MeshRendererMT() = default;

	void Renderer(entt::registry& registry) override;
};
#endif