//===================================================
//
// メッシュの球体の更新処理 [mesh_sphere_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_SPHERE_SYSTEM_H_
#define _MESH_SPHERE_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// 球体メッシュの更新処理
//***************************************************
struct MeshSphereSystem : SystemBase
{
	MeshSphereSystem() = default;
	~MeshSphereSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif
