//===================================================
//
// メッシュのレイヤー [mesh_layer.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_LAYER_H_
#define _MESH_LAYER_H_

//***************************************************
// メッシュのレイヤー
//***************************************************
namespace MeshLayer
{
	enum LAYER
	{
		LAYER_FIELD = 0,	// フィールド
		LAYER_CIRYNDER,		// シリンダー
		LAYER_WALL,			// 壁
		LAYER_CIRCLE,		// サークル
		LAYER_ORBIT,		// 軌跡
		LAYER_QUAD,			// 3Dポリゴン
		LAYER_MAX
	};
}
#endif