//===================================================
//
// 3Dポリゴンの更新処理 [mesh_quad_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_QUAD_SYSTEM_H_
#define _MESH_QUAD_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// 3Dポリゴンの更新処理
//***************************************************
struct MeshQuadSystem : SystemBase
{
	MeshQuadSystem() = default;
	~MeshQuadSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif