//===================================================
//
// メッシュの軌跡の処理 [mesh_orbit_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_ORBIT_SYSTEM_H_
#define _MESH_ORBIT_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// メッシュの軌跡の処理の定義
//***************************************************
struct MeshOrbitSystem : SystemBase
{
	MeshOrbitSystem() = default;
	~MeshOrbitSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif