//===================================================
//
// メッシュサークルの処理 [mesh_circle_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_CIRCLE_SYSTEM_H_
#define _MESH_CIRCLE_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// メッシュサークルの処理の定義
//***************************************************
struct MeshCircleSystem : SystemBase
{
	MeshCircleSystem() = default;
	~MeshCircleSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif