//===================================================
//
// メッシュの描画systemの処理 [mesh_renderer.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_RENDERER_H_
#define _MESH_RENDERER_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "renderer_system_base.h"

//***************************************************
// メッシュの描画処理の定義
//***************************************************
struct MeshRenderer : RendererSystemBase
{
	MeshRenderer() = default;
	~MeshRenderer() = default;

	void Renderer(entt::registry& registry) override;
};
#endif