//===================================================
//
// // モーションのファイルをロードする処理 [motion_loader.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MOTION_LOADER_H_
#define _MOTION_LOADER_H_

//***************************************************
// モーションのファイルをロードする処理
//***************************************************
namespace Loader::Motion
{
	HRESULT Load(entt::entity characterID, entt::registry& registry, const char* pMotionTxtPath);
}
#endif