//===================================================
//
// パーティクルの処理 [particle_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _PARTICLE_SYSTEM_H_
#define _PARTICLE_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// パーティクルの処理の定義
//***************************************************
struct ParticleSystem : SystemBase
{
	ParticleSystem() = default;
	~ParticleSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif