//===================================================
//
// ポーズのメニューの更新処理 [pause_menu_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _PAUSE_MENU_SYSTEM_H_
#define _PAUSE_MENU_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// ポーズのメニューの更新処理の定義
//***************************************************
struct PauseMenuSystem : SystemBase
{
	PauseMenuSystem() = default;
	~PauseMenuSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif