//===================================================
//
// リザルトのロード処理 [result_loader.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _RESULT_LOADER_H_
#define _RESULT_LOADER_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "ranking_component.hpp"

//***************************************************
// リザルトのロードの生成処理の定義
//***************************************************
namespace Loader::Result
{
	int GetScore(void);
	HRESULT MinigameRanking(std::array<int, RankingComponent::MAX_RANK>& aRankingID);
}
#endif