//===================================================
//
//  リザルトのボールの更新処理 [result_ball_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _RESULT_BALL_SYSTEM_H_
#define _RESULT_BALL_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// リザルトのボールの更新処理の定義
//***************************************************
struct ResultBallSystem : SystemBase
{
	ResultBallSystem() = default;
	~ResultBallSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif