//===================================================
//
// シーン変更時の値の定数 [scene_change_constants.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _SCENE_CHANGE_CONSTANTS_H_
#define _SCENE_CHANGE_CONSTANTS_H_

//***************************************************
// シーン変更時の値の定数の名前空間の定義
//***************************************************
namespace SceneChangeConst
{
	constexpr int GAME_TO_RESULT = 120;	// ゲームからリザルトに行く時間
	constexpr int TITLE_TO_RESULT = 180;	// ゲームからリザルトに行く時間
}
#endif