//===================================================
//
// スコアの更新処理 [score_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _SCORE_SYSTEM_H_
#define _SCORE_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// スコアの更新処理
//***************************************************
struct ScoreSystem : SystemBase
{
	ScoreSystem() = default;
	~ScoreSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif