//===================================================
//
// 影の更新処理 [shadow_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _SHADOW_SYSTEM_H_
#define _SHADOW_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// 影の処理の定義
//***************************************************
struct ShadowSystem : SystemBase
{
	ShadowSystem() = default;
	~ShadowSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif