//================================================
//
// タイトルの壁の処理 [title_wall_system.h]
// Author: YUTO YOSHIDA
//
//================================================

//*************************************************
// 多重インクルード防止
//*************************************************
#ifndef _TITLE_WALL_SYSTEM_H_
#define _TITLE_WALL_SYSTEM_H_

//************************************************
// インクルードファイル
//************************************************
#include "system_base.h"

//************************************************
// タイトルの壁の処理の定義
//************************************************
struct TitleWallSystem : SystemBase
{
	TitleWallSystem() = default;
	~TitleWallSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif