//===================================================
//
// タイトルのメニューの更新処理 [title_menu_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _TITLE_MENU_SYSTEM_H_
#define _TITLE_MENU_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// タイトルのメニューの更新処理の定義
//***************************************************
struct TitleMenuSystem : SystemBase
{
	TitleMenuSystem() = default;
	~TitleMenuSystem() = default;

	void Update(entt::registry& registry) override;
private:

};
#endif