//===================================================
//
// タイトルメニューの種類 [tItle_menu.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _TITLE_MENU_H_
#define _TITLE_MENU_H_

//***************************************************
// タイトルのメニューの種類
//***************************************************
namespace TItleMenu
{
	enum TYPE
	{
		TYPE_MINIGAME = 0,	// ミニゲーム
		TYPE_QUIT,			// QUIT
		TYPE_MAX
	};
}
#endif