//===================================================
//
// フェードアウトするUIの更新処理 [ui_fadeout_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _UI_FADEOUT_SYSTEM_H_
#define _UI_FADEOUT_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// フェードアウトするUIの更新処理の定義
//***************************************************
struct UIFadeOutSystem : SystemBase
{
	UIFadeOutSystem() = default;
	~UIFadeOutSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif