//================================================
//
// UIの点滅処理 [ui_flash_system.h]
// Author:YUTO YOSHIDA
//
//=================================================

//*************************************************
// 多重インクルード防止
//*************************************************
#ifndef _UIFLASH_SYSTEM_H_
#define _UIFLASH_SYSTEM_H_

//*************************************************
// インクルードファイル
//*************************************************
#include "system_base.h"

//*************************************************
// UIの点滅処理の定義
//*************************************************
struct UIFlashSystem : SystemBase
{
	UIFlashSystem() = default;
	~UIFlashSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif