//===================================================
//
// UIの拡大縮小アニメーションの更新処理 [ui_scaling_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _UI_SCALING_SYSTEM_H_
#define _UI_SCALING_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// UIの拡大縮小アニメーションの更新処理の定義
//***************************************************
struct UIScalingSystem : public SystemBase
{
	UIScalingSystem() = default;
	~UIScalingSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif