//===================================================
//
// UIのスライドイン、アウトのアニメーションの処理 [ui_slide_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef UI_SLIDE_SYSTEM_H_
#define UI_SLIDE_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// UIのスライドイン、アウトのアニメーションの処理の定義
//***************************************************
struct UISlideSystem : SystemBase
{
	UISlideSystem() = default;
	~UISlideSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif