//===================================================
//
// UIの壁の更新処理 [ui_wall_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _UI_WALL_SYSTEM_H_
#define _UI_WALL_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// UIの壁の更新処理
//***************************************************
struct UIWallSystem : SystemBase
{
	UIWallSystem() = default;
	~UIWallSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif