//===================================================
//
// 壁のエフェクトの更新処理 [wall_effect_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _WALL_EFFECT_SYSTEM_H_
#define _WALL_EFFECT_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "system_base.h"

//***************************************************
// 壁のエフェクトの更新処理の定義
//***************************************************
struct WallEffectSystem : SystemBase
{
	WallEffectSystem() = default;
	~WallEffectSystem() = default;

	void Update(entt::registry& registry) override;
};
#endif