//===================================================
//
// 壁のUIの種類 [wall_ui_type.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _WALL_UI_TYPE_HPP_
#define _WALL_UI_TYPE_HPP_

//***************************************************
// 壁のUIの種類の定義
//***************************************************
namespace WallUIType
{
	// 種類
	enum TYPE
	{
		TYPE_NONE = 0,			// 無し
		TYPE_TITLE,				// タイトル
		TYPE_TUTO_TASK_1,		// チュートリアルのタスク1
		TYPE_MAX
	};
}
#endif