//===================================================
//
// ゲームに関わる処理の補助を担当するクラス [world_system.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _WORLD_SYSTEM_H_
#define _WORLD_SYSTEM_H_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// ゲームに関わる処理の補助を担当するクラスの定義
//***************************************************
class CWorldSystem
{
public:
	CWorldSystem() = default;
	virtual ~CWorldSystem() = default;

	virtual HRESULT Init(void) = 0;
	virtual void Uninit(void) = 0;
	virtual void Update(void) = 0;
	virtual void Draw(void) = 0;
private:
};
#endif
