//===================================================
// 
// アウトラインシェーダー [outline.hlsl]
// Author : YUTO YOSHIDA
//
//===================================================

//***************************************************
// グローバル変数宣言
//***************************************************
float g_OutLineWidth = 0.05f; // 膨らませる幅
float4 g_OutLineColor = float4(0.0f, 0.0f, 0.0f, 1.0f); // 黒
float4x4 g_WorldViewProj;

//**************************************************
// シェーダーに渡すための頂点情報
//**************************************************
struct VS_INPUT
{
    float3 pos : POSITION;
    float3 normal : NORMAL;
};

//**************************************************
// ピクセルシェーダに渡す情報
//**************************************************
struct VS_OUTPUT
{
    float4 pos : POSITION;
};

//===================================================
// 法線方向に膨らませる処理
//===================================================
VS_OUTPUT VS_OutLine(VS_INPUT input)
{
    // 出力用変数
    VS_OUTPUT output;
    
    // 法線方向に拡大した位置を求める
    float3 posOffset = input.pos + input.normal * g_OutLineWidth;
    
    output.pos = mul(float4(posOffset, 1.0f), g_WorldViewProj);

    return output;
}

//===================================================
// 色を設定
//===================================================
float4 main() : SV_TARGET
{
    return g_OutLineColor;
  
}

//===================================================
// テクニック宣言
//===================================================
technique tech
{
    pass P0
    {
        VertexShader = compile vs_3_0 VS_OutLine();
        PixelShader = compile ps_3_0 main();
    }
}