//***************************************************
//
// ジャグリングボール
// Author:YUTO YOSHIDA
//
//***************************************************
#include "hulaobj.h"
#include "myMath.h"
#include "player.h"
#include "game.h"
#include "ruleBalance.h"
#include "ruleJuggling.h"

//***************************************************
// ジャグリングボール
//***************************************************
CHula::CHula()
{
	m_fmove = 0.0f;
}

//***************************************************
// ジャグリングボール
//***************************************************
CHula::~CHula()
{

}

//***************************************************
// ジャグリングボール初期化
//***************************************************
HRESULT CHula::Init(void)
{
	return S_OK;
}

//***************************************************
// ジャグリングボール初期化
//***************************************************
void CHula::Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	m_pHulaObj = CObjectX::Create(pos, "Model()\\hulahoop.x", rot);
}

//***************************************************
// ジャグリングボール破棄
//***************************************************
void CHula::Uninit(void)
{
	m_pHulaObj->Uninit();
	Release();
}

//***************************************************
// ジャグリングボール
//***************************************************
void CHula::Update(void)
{
	m_fmove -= 0.2f;
	D3DXVECTOR3 pos = m_pHulaObj->GetPosition();
	pos.y += m_fmove;
	m_pHulaObj->SetPosition(pos);

	if (pos.y <= -100)
	{
		Uninit();
		return;
	}
}

//***************************************************
// ジャグリングボール
//***************************************************
void CHula::Draw(void)
{

}

//***************************************************
// ジャグリングボール生成
//***************************************************
void CHula::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	CHula* pHula = new CHula;
	pHula->Init(pos, rot);
}