//===================================================
//
// メニューのマネージャーの基底クラスの定義 [MenuManager.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "MenuManager.h"
#include "MenuCommandBase.h"

//===================================================
// コンストラクタ
//===================================================
CMenuManager::CMenuManager() : 
	m_vMenuEntries()
{
}

//===================================================
// デストラクタ
//===================================================
CMenuManager::~CMenuManager()
{
	m_vMenuEntries.clear();
}

//===================================================
// 終了処理
//===================================================
void CMenuManager::Uninit(void)
{
	for (auto &menu : m_vMenuEntries)
	{
		// コマンドの破棄
		menu.pMenuCommand.reset();
	}

	// 自分自身の破棄
	CObject::Release();
}