//================================================
//
// プレイヤーのファクトリー [ScenePlayerFactory.h]
// Author:YUTO YOSHIDA
//
//=================================================

//*************************************************
// 多重インクルード防止
//*************************************************
#ifndef _SCENE_PLAYER_FACTORY_H_
#define _SCENE_PLAYER_FACTORY_H_

//*************************************************
// インクルードファイル
//*************************************************
#include "ScenePlayer.h"

//*************************************************
// プレイヤーのファクトリーの定義
//*************************************************
namespace ScenePlayerFactory
{
	CScenePlayer* Create(const CScenePlayer::Type type, const D3DXVECTOR3 pos, const D3DXVECTOR3 rot);
}
#endif