//==============================================
//
// ステージをロードするクラス [StageLoader.h]
// Author:YUTO YOSHIDA
// 
// << タイトル、ゲーム等のステージをロードするクラス >>
//
//==============================================

//**********************************************
// 多重インクルード防止
//**********************************************
#ifndef _STAGE_LOADER_H_
#define _STAGE_LOADER_H_

//**********************************************
// インクルードファイル
//**********************************************

//**********************************************
// 前方宣言
//**********************************************
class CCollisionMapObjManager; // 当たり判定するマップオブジェクトのマネージャー

//**********************************************
// ステージのローダークラスの定義
//**********************************************
class CStageLoader
{
public:
	~CStageLoader();

	// ステージのロード(使用例 : Load(マップオブジェクトのマネージャーのインスタンス : "ステージのjsonファイルのパス.json"))
	static HRESULT Load(CCollisionMapObjManager* pMapObjectManager, const char* pStageJsonPath);

private:
	CStageLoader();

	static CCollisionMapObjManager* m_pMapObjectManager; // マップオブジェクトのマネージャーの参照
};
#endif