//===================================================
//
// コライダーのデータ [collider_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _COLLIDER_COMPONENT_HPP_
#define _COLLIDER_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// コライダーのデータの定義
//***************************************************
struct ColliderComponent
{
	ColliderComponent() :
		collider() {}

	// コライダーのデータ
	struct Data
	{
		// コライダーの種類
		enum class Type : uint8_t
		{
			Box = 0,
			Sphere,
			Capsule,
			Fov,
			Max
		};

		entt::entity id;	// コライダーのID
		Type type;			// 形状
		//uint8_t index;	// インデックス
	};

	std::vector<Data> collider;
};
#endif