//===================================================
//
// 色のデータ [color_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _COLOR_COMPONENT_HPP_
#define _COLOR_COMPONENT_HPP_

//***************************************************
// 色のデータの定義
//***************************************************
struct ColorComponent
{
	ColorComponent(const D3DXCOLOR& _col = Const::WHITE) :
		col(_col)
	{}

	D3DXCOLOR col; // 色
};
#endif