//===================================================
//
// メッシュの壁のデータ [mesh_wall_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MESH_WALL_COMPONENT_HPP_
#define _MESH_WALL_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// メッシュの壁のコンポーネント
//***************************************************
struct MeshWallComponent
{
	MeshWallComponent(const bool _bMult) :
		bMult(_bMult) {}

	bool bMult;	// マルチテクスチャかどうか
};
#endif