//===================================================
//
// モデルのデータ [model_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef MODEL_COMPONENT_HPP_
#define MODEL_COMPONENT_HPP_

//***************************************************
// モデルのデータ構造体の定義
//***************************************************
struct ModelComponent
{
	ModelComponent(const int _nModelID) : nModelID(_nModelID) {}

	int nModelID; // モデルのID
};
#endif