//===================================================
//
// プレイヤーのデータ [player_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _PLAYER_COMPONENT_HPP_
#define _PLAYER_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// プレイヤーのデータの定義
//***************************************************
struct PlayerComponent
{
	PlayerComponent() : 
		fPadMoveAngle(0.0f), nChargeTime(0)
	{}

	float fPadMoveAngle;	// パッドの移動方向
	int nChargeTime;			// チャージしているかどうか
};
#endif