//===================================================
//
// ランキングのデータ [ranking_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _RANKING_COMPONENT_HPP_
#define _RANKING_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// ランキングのデータの定義
//***************************************************
struct RankingComponent
{
	static constexpr int MAX_RANK = 5; // 順位数

	RankingComponent() : 
		aScoreID()
	{}

	std::array<entt::entity, MAX_RANK> aScoreID; // スコアのID
};
#endif