//===================================================
//
// ランキングのハイライト表示のデータ [ranking_highlight_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _RANKING_HIGHLIGHT_COMPONENT_HPP_
#define _RANKING_HIGHLIGHT_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// ランキングのハイライト表示のデータの定義
//***************************************************
struct RankingHighLightComponent
{
	RankingHighLightComponent() : 
		fTime(0.0f)
	{}

	float fTime; // 時間
};
#endif