//===================================================
//
// 円形のエンティティの大きさのデータ [sphere_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _SPHERE_COMPONENT_HPP_
#define _SPHERE_COMPONENT_HPP_

//***************************************************
// 円形のエンティティの大きさのデータの定義
//***************************************************
struct SphereComponent
{
	SphereComponent(const float _fRadius) : fRadius(_fRadius) {}

	float fRadius; // 半径
};
#endif