//===================================================
//
// テクスチャスクロールのデータ [TextureScrolComponent.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _TEXTURE_SCROL_COMPONENT_HPP_
#define _TEXTURE_SCROL_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// テクスチャのスクロールのデータの定義
//***************************************************
struct TextureScrolComponent
{
	TextureScrolComponent(const D3DXVECTOR2& _speed) : 
		speed(_speed) {}

	D3DXVECTOR2 speed;		// スクロールの速さ
};
#endif