//===================================================
//
// ブルームシェーダーを適応するクラス [bloom_shader.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "bloom_shader.h"

//===================================================
// コンストラクタ
//===================================================
CBloomShader::CBloomShader()
{
}

//===================================================
// デストラクタ
//===================================================
CBloomShader::~CBloomShader()
{
}

//===================================================
// 初期化処理
//===================================================
HRESULT CBloomShader::Init(const char* pShaderFile, const char* pTech)
{
	// 初期化処理
	if (FAILED(CShader::Init(pShaderFile, pTech)))
	{
		return E_FAIL;
	}

	return S_OK;
}

//===================================================
// 適応処理
//===================================================
void CBloomShader::Apply(const entt::registry* pRegistry, const entt::entity entity)
{
	// 使わない
	(void)pRegistry;
	(void)entity;
}